realraum/esp8266-r3-ledstrip/src/websocket.cpp
#include "websocket.hpp"

// system includes
#include <string>

// arduino includes
#include <Arduino.h>
#include <ESP8266WiFi.h>

// 3rdparty lib includes
#include <ESPAsyncWebServer.h>
#include <AsyncWebSocket.h>
#include <ArduinoJson.h>

// local includes
#include "leds.hpp"

#define DEBUG 1

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");

namespace wifi
{

    namespace
    {

        void handleWebSocketMessage(void *arg, uint8_t *data, size_t len, AsyncWebSocketClient *client)
        {
            AwsFrameInfo *info = (AwsFrameInfo *)arg;
            if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT)
            {
                // parse the message
                StaticJsonDocument<200> doc;
                DeserializationError error = deserializeJson(doc, data);
                if (error)
                {
                    if (DEBUG)
                        Serial.printf("deserializeJson() failed: %s\n", error.c_str());
                    return;
                }

                if (!doc.containsKey("c"))
                {
                    if (DEBUG)
                        Serial.println("No command found");
                    return;
                }

                std::string command = doc["c"].as<std::string>();

                // handle the command
                if (command == "l")
                {
                    // create response with string concat
                    std::string response = "{\"c\":\"l\",\"a\":[";
                    iterateAnimation([&response](auto enum_value, const std::string &string_value)
                                     {
                        if (enum_value != Animation::__NONEXISTENT__)
                        response += "\"";
                        response += string_value;
                        response += "\","; });

                    // remove last comma
                    response.pop_back();
                    response += "]}";

                    // send response
                    client->text(response.c_str());
                }
                else if (command == "a")
                {
                    if (!doc.containsKey("a") || !doc["a"].is<std::string>())
                    {
                        if (DEBUG)
                            Serial.println("No animation found");
                        return;
                    }

                    leds::animation = parseAnimation(doc["a"].as<std::string>());
                    Serial.printf("Set animation to %s\n", doc["a"].as<std::string>().c_str());
                }
                else if (command == "s")
                {
                   if (!doc.containsKey("d") || !doc["d"].is<uint16_t>())
                    {
                        if (DEBUG)
                            Serial.println("No time found");
                        return;
                    }

                    leds::activateStrobo(doc["d"].as<uint16_t>());
                }
                else if (command == "c")
                {
                    // solid color
                    if (!doc.containsKey("r") || !doc["r"].is<uint8_t>() ||
                        !doc.containsKey("g") || !doc["g"].is<uint8_t>() ||
                        !doc.containsKey("b") || !doc["b"].is<uint8_t>())
                    {
                        if (DEBUG)
                            Serial.println("No color found");
                        return;
                    }

                    leds::solidColor = CRGB(doc["r"].as<uint8_t>(), doc["g"].as<uint8_t>(), doc["b"].as<uint8_t>());
                }
            }
        }

        void onEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
        {
            switch (type)
            {
            case WS_EVT_CONNECT:
                Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
                break;
            case WS_EVT_DISCONNECT:
                Serial.printf("WebSocket client #%u disconnected\n", client->id());
                break;
            case WS_EVT_DATA:
                handleWebSocketMessage(arg, data, len, client);
                break;
            case WS_EVT_PONG:
            case WS_EVT_ERROR:
                break;
            }
        }
    } // namespace

    void begin()
    {
        enableWiFiAtBootTime();
        Serial.printf("Connecting to %s (%s)\n", ssid, password);
        WiFi.begin(ssid, password);
        while (WiFi.status() != WL_CONNECTED)
        {
            delay(10);
        }

        Serial.printf("Connected to %s with IP %s\n", ssid, WiFi.localIP().toString().c_str());

        ws.onEvent(onEvent);
        server.addHandler(&ws);

        server.begin();
    }

    void handle()
    {
        static uint32_t last = 0;
        ws.cleanupClients();

        if (millis() - last > 1000)
        {
            last = millis();
            ws.textAll(F("{\"ping\":true}"));
        }
    }

} // namespace wifi
